Merge pull request #32 from decentpaste/feature/hardware-security-v1
Feature/hardware security v1
